load-testing/artillery.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up
    - duration: 120
      arrivalRate: 3
      rampTo: 20
      name: Ramp up load
    - duration: 240
      arrivalRate: 20
      name: Sustained load
  processor: './lib/processor.js'
  environments:
    alfajores:
      target: 'https://alfajores-blockscout.celo-testnet.org'
    baklava:
      target: 'https://baklava-blockscout.celo-testnet.org'
    mainnet:
      target: 'https://rc1-blockscout.celo-testnet.org'
scenarios:
  - name: 'GraphQL Query load test'
    flow:
      - function: 'loadTestCases'
      - loop:
          - post:
              url: '/graphiql'
              json:
                query: '{{ $loopElement.query }}'
                variables: '{{ $loopElement.variables }}'
          - log: '----------------------------------'
          - log: 'Sent a request to the {{ $loopElement.operation }}: {{ $loopElement.name }}'
          - log: 'And variables {{ $loopElement.variables }}'
        over: cases